cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'derailed/k9s'
tap 'oven-sh/bun'

# zsh plugins
brew 'powerlevel10k'
brew 'zsh-autosuggestions'

# Dev stuff
brew 'spaceman-diff'
brew 'wget'
brew 'derailed/k9s/k9s'
brew 'kubernetes-cli'
brew 'commitizen'
brew 'direnv'
brew 'jq'
brew 'gitlab-ci-local'
brew 'openssl'
brew 'tinyproxy'
brew 'netcat'
# iOS
brew 'fastlane'
brew 'cocoapods'
# Node
brew 'nvm'
brew 'bun'
# Python
brew 'pyenv'
brew 'poetry'
brew 'make'

# other stuff
brew 'yt-dlp'
brew 'ffmpeg'

# apps
cask 'google-chrome-canary'
cask 'notion'
cask 'sonos'
cask 'visual-studio-code'
cask 'vlc'
cask 'swiftbar'
cask 'appcleaner'
cask 'rectangle'
cask 'docker'
cask 'microsoft-teams'
cask 'slack'
cask 'microsoft-outlook'
cask 'dozer'
cask 'copyclip'
cask 'maccy'
cask 'lens'
cask 'postico'
cask 'readdle-spark'
cask 'pika'
cask 'ngrok'
cask 'iterm2'
cask 'rescuetime'
cask 'ollama'
cask 'transmission'
cask 'dbeaver-community'
cask 'figma'
